void setup() {
  size (800, 800);
  background (160);
}
void draw() {
  luckaTjugofyra();
  println(mouseX, mouseY);
}
void luckaTjugofyra () {
  noStroke();
  //KROPP & BYXOR
  fill(153, 0, 0);
  triangle(377, 276, 550, 531, 222, 531); //kropp
  rect (310, 530, 50, 70); //vänster ben
  rect (410, 530, 50, 70); //höger ben
  quad(241,372,335,349,320,370,243,391);
  quad(211,309,222,309,248,373,243,392);
  quad(424,347,493,378,488,395,442,374);
  quad(494,378,507,386,485,438,475,424);
 
 
  //SKOR
  fill(102, 51, 0);
  rect(315, 600, 40, 10, 10);
  rect(415, 600, 40, 10, 10);
  rect(295, 605, 60, 30, 10);
  rect(415, 605, 60, 30, 10);

  //VIT PÅ BYXOR
  fill(255);
  rect(307, 590, 55, 10, 10);
  rect(407, 590, 55, 10, 10);

  //VITT PÅ KROPP
  fill(255);
  quad(230, 508, 541, 508, 552, 534, 220, 534);

  //SKÄRP
  fill(0);
  quad(271, 450, 496, 450, 506, 465, 261, 465);
  rect(360,442,40,30);
  fill(249,215,47);
  quad(268, 455, 499, 455, 500, 457, 266, 457);
  rect(370,451,20,10);
  
  //ANSIKTE
  fill(255,242,215);
  ellipse (377,276,90,110); //face
 //HATT
 fill(153, 0, 0);
 quad(380,177,390,177,425,260,330,260);
 triangle(390,178,439,240,400,206);
 fill(255);
 ellipse(440,243,20,20);
 rect(327,249,100,20,10);
 
 //SÄCK
fill(102, 51, 0);
rect(150,160,130,170,40);
triangle(184,140,247,142,214,202);
 
}